Repository: youtonghy/Todex_mobile
Catalog: Todex/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko

source: Agent 当前正忙，请求会进入候选队列，待当前任务结束后发送。
en: The Agent is busy. The request will be added to the candidate queue and sent after the current task finishes.
ja: エージェントは現在処理中です。リクエストは候補キューに追加され、現在のタスクの終了後に送信されます。
ko: 에이전트가 현재 작업 중입니다. 요청은 후보 큐에 추가되어 현재 작업이 끝난 후 전송됩니다.

source: …（差异过大已截断）
en: … (diff too large, truncated)
ja: …（差分が大きすぎるため省略されました）
ko: …(차이가 너무 커서 잘림)

source: 可用于：
en: Can be used for:
ja: 用途：
ko: 사용 가능:

source: 已附加到草稿 · 点按移除
en: Attached to draft · Tap to remove
ja: 下書きに添付済み · タップで削除
ko: 초안에 첨부됨 · 탭하여 제거

source: 来源：%@
en: Source: %@
ja: ソース：%@
ko: 출처: %@

source: 目标仓库：%@
en: Target repository: %@
ja: 対象リポジトリ：%@
ko: 대상 리포지토리: %@

source: 请先刷新版本及现有操作，再决定是否重试。
en: Refresh the version and existing actions before deciding whether to retry.
ja: バージョンと既存の操作を更新してから、再試行するかどうか判断してください。
ko: 버전과 기존 작업을 새로고침한 후 다시 시도할지 결정하세요.

source: 读取最新版本后可手动合并；不会覆盖远端。
en: Load the latest version to merge manually; the remote will not be overwritten.
ja: 最新バージョンを読み込んだ後、手動でマージできます。リモートは上書きされません。
ko: 최신 버전을 불러온 후 수동으로 병합할 수 있습니다. 원격은 덮어쓰지 않습니다.

source: 错误：%@
en: Error: %@
ja: エラー：%@
ko: 오류: %@

source: [2m[TodeX] 终端已退出，正在自动重启…[0m
en: [2m[TodeX] Terminal exited, restarting automatically…[0m
ja: [2m[TodeX] ターミナルが終了しました。自動的に再起動しています…[0m
ko: [2m[TodeX] 터미널이 종료되었습니다. 자동으로 다시 시작하는 중…[0m

source: 已完成
en: Done
ja: 完了
ko: 완료

source: 计划中
en: Planned
ja: 予定
ko: 계획됨

source: Agent 账户操作
en: Agent account actions
ja: エージェントアカウント操作
ko: 에이전트 계정 작업

source: Agent 账户管理
en: Agent account management
ja: エージェントアカウント管理
ko: 에이전트 계정 관리

source: CLI 升级
en: CLI upgrade
ja: CLI アップグレード
ko: CLI 업그레이드

source: CLI 管理
en: CLI management
ko: CLI 관리

source: · %lld 秒后自动重启
en: · Auto-restart in %lld s
ja: · %lld 秒後に自動再起動
ko: · %lld초 후 자동 재시작

source: · 不可用
en: · Unavailable
ja: · 利用不可
ko: · 사용 불가

source: · 已暂停
en: · Paused
ja: · 一時停止中
ko: · 일시 중지됨

source: · 已暂停，请核对
en: · Paused, please review
ja: · 一時停止中、確認してください
ko: · 일시 중지됨, 확인 필요

source: · 已附加
en: · Attached
ja: · 添付済み
ko: · 첨부됨

source: · 自动合并 %@
en: · Auto-merge %@
ja: · 自動マージ %@
ko: · 자동 머지 %@

source: · 达到后端上限，请搜索更具体的路径
en: · Backend limit reached; search for a more specific path
ja: · バックエンドの上限に達しました。より具体的なパスで検索してください
ko: · 백엔드 한도에 도달했습니다. 더 구체적인 경로를 검색하세요

source: · 默认
en: · Default
ja: · デフォルト
ko: · 기본

source: 模型列表
en: Model list
ja: モデル一覧
ko: 모델 목록

source: $%@ · 移除
en: $%@ · Remove
ja: $%@ · 削除
ko: $%@ · 제거

source: %@ 网络中断可能发生在后端接收之后。核对历史不会再次发送消息。
en: %@ The network may have dropped after the backend received the message. Reviewing history will not resend it.
ja: %@ ネットワークの切断はバックエンドの受信後に発生した可能性があります。履歴を確認してもメッセージは再送されません。
ko: %@ 네트워크 끊김은 백엔드가 메시지를 수신한 후에 발생했을 수 있습니다. 기록을 확인해도 메시지는 다시 전송되지 않습니다.

source: %@ %@ → %@ · head %@ 合并方式：%@ · %@
en: %@ %@ → %@ · head %@ Merge method: %@ · %@
ja: %@ %@ → %@ · head %@ マージ方法：%@ · %@
ko: %@ %@ → %@ · head %@ 머지 방식: %@ · %@

source: %@ %lld 项
en: %@ %lld items
ja: %@ %lld 件
ko: %@ %lld개 항목

source: %@ MCP 列表由当前对话的 Agent 提供，通用视图仅显示其中共享来源的服务。
en: %@ The MCP list is provided by the current conversation's Agent; the general view shows only servers from shared sources.
ja: %@ MCP 一覧は現在の会話のエージェントが提供します。共通ビューには共有ソースのサーバーのみ表示されます。
ko: %@ MCP 목록은 현재 대화의 에이전트가 제공합니다. 공통 보기에는 공유 소스의 서버만 표시됩니다.

source: %@ → %@ Agent 将能够在新目录执行任务；原目录的执行信任会被撤销，已有对话仍属于原目录。
en: %@ → %@ The Agent will be able to run tasks in the new directory. Execution trust for the original directory will be revoked; existing conversations stay with the original directory.
ja: %@ → %@ エージェントは新しいディレクトリでタスクを実行できるようになります。元のディレクトリの実行の信頼は取り消され、既存の会話は元のディレクトリに残ります。
ko: %@ → %@ 에이전트가 새 디렉터리에서 작업을 실행할 수 있게 됩니다. 원래 디렉터리의 실행 신뢰는 해제되며, 기존 대화는 원래 디렉터리에 남습니다.

source: %@ 信任允许后端 Agent 执行项目中的任务；这不是文件系统沙箱。
en: %@ Trust lets the backend Agent run tasks in the project; it is not a file system sandbox.
ja: %@ 信頼すると、バックエンドのエージェントがプロジェクト内でタスクを実行できます。これはファイルシステムのサンドボックスではありません。
ko: %@ 신뢰하면 백엔드 에이전트가 프로젝트에서 작업을 실행할 수 있습니다. 이는 파일 시스템 샌드박스가 아닙니다.

source: %@ 将撤销执行信任并停止此工作区正在运行的任务，后端对话会保留。
en: %@ This revokes execution trust and stops running tasks in this workspace. Backend conversations are kept.
ja: %@ 実行の信頼を取り消し、このワークスペースで実行中のタスクを停止します。バックエンドの会話は保持されます。
ko: %@ 실행 신뢰를 해제하고 이 워크스페이스에서 실행 중인 작업을 중지합니다. 백엔드 대화는 유지됩니다.

source: %@ 工作树路径：%@ 可稍后在工作树列表中重试「打开工作树」。
en: %@ Worktree path: %@ You can retry "Open worktree" later from the worktree list.
ja: %@ ワークツリーのパス：%@ 後でワークツリー一覧から「ワークツリーを開く」を再試行できます。
ko: %@ 워크트리 경로: %@ 나중에 워크트리 목록에서 "워크트리 열기"를 다시 시도할 수 있습니다.

source: %@ 需要已运行且支持 gitDiffToRemote 的 Legacy Codex session；普通 V2 会话不保证支持。未自动启动旧适配器。
en: %@ Requires a running Legacy Codex session that supports gitDiffToRemote; regular V2 sessions are not guaranteed to support it. The legacy adapter was not started automatically.
ja: %@ gitDiffToRemote に対応した実行中の Legacy Codex session が必要です。通常の V2 セッションでは対応が保証されません。旧アダプターは自動起動されていません。
ko: %@ gitDiffToRemote를 지원하는 실행 중인 Legacy Codex session이 필요합니다. 일반 V2 세션은 지원이 보장되지 않습니다. 이전 어댑터는 자동으로 시작되지 않았습니다.

source: %@ · %lld 个变更 · +%lld −%lld
en: %@ · %lld changes · +%lld −%lld
ja: %@ · %lld 件の変更 · +%lld −%lld
ko: %@ · 변경 %lld개 · +%lld −%lld

source: %@ · 上次使用
en: %@ · Last used
ja: %@ · 前回使用
ko: %@ · 마지막 사용

source: %@ · 会话
en: %@ · session
ja: %@ · セッション
ko: %@ · 세션

source: %@ · 分叉
en: %@ · fork
ja: %@ · 分岐
ko: %@ · 분기

source: %@ · 分支 %@ · %lld 个变更文件 +%lld −%lld
en: %@ · branch %@ · %lld changed files +%lld −%lld
ja: %@ · ブランチ %@ · 変更ファイル %lld 件 +%lld −%lld
ko: %@ · 브랜치 %@ · 변경된 파일 %lld개 +%lld −%lld

source: %@ · 附加后，Backend 在下一条消息读取并注入此 Skill；再次点按目录中的已附加项可移除。
en: %@ · Once attached, the backend reads and injects this Skill with the next message. Tap the attached item in the catalog again to remove it.
ja: %@ · 添付すると、次のメッセージでバックエンドがこの Skill を読み取って注入します。カタログ内の添付済み項目をもう一度タップすると削除できます。
ko: %@ · 첨부하면 다음 메시지에서 백엔드가 이 Skill을 읽어 주입합니다. 목록에서 첨부된 항목을 다시 탭하면 제거됩니다.

source: %@ 摘录
en: %@ excerpt
ja: %@ 抜粋
ko: %@ 발췌

source: %@ 操作
en: %@ actions
ko: %@ 작업

source: %@ 模型
en: %@ models
ja: %@ モデル
ko: %@ 모델

source: %@ 等 %lld 个模型
en: %@ and others (%lld models)
ja: %@ など %lld 個のモデル
ko: %@ 등 모델 %lld개

source: %@（工作区根目录）
en: %@ (workspace root)
ja: %@（ワークスペースのルート）
ko: %@(워크스페이스 루트)

source: %@（已逾期）
en: %@ (overdue)
ja: %@（期限切れ）
ko: %@(기한 지남)

source: %lld 个仓库 · 点按切换
en: %lld repositories · Tap to switch
ja: %lld 個のリポジトリ · タップで切り替え
ko: 리포지토리 %lld개 · 탭하여 전환

source: %lld 个关联任务，%@
en: %lld linked tasks, %@
ja: 関連タスク %lld 件、%@
ko: 연결된 작업 %lld개, %@

source: %lld 个变更文件 · +%lld −%lld
en: %lld changed files · +%lld −%lld
ja: 変更ファイル %lld 件 · +%lld −%lld
ko: 변경된 파일 %lld개 · +%lld −%lld

source: %lld 条记录
en: %lld records
ja: %lld 件の記録
ko: 기록 %lld개

source: %lld 条记录尚无可确认数值
en: %lld records have no confirmed values yet
ja: %lld 件の記録にはまだ確認できる数値がありません
ko: 기록 %lld개에 아직 확인 가능한 값이 없습니다

source: %lld 条记录已报告
en: %lld records reported
ja: %lld 件の記録が報告済み
ko: 기록 %lld개 보고됨

source: %lld/%lld 条已报告，另有 %lld 条未知
en: %lld/%lld reported, %lld more unknown
ja: %lld/%lld 件が報告済み、ほかに %lld 件が不明
ko: %lld/%lld개 보고됨, 그 외 %lld개 알 수 없음

source: %lld/%lld 条记录的缓存口径和输入明细可确认
en: Cache accounting and input breakdown confirmed for %lld/%lld records
ja: %lld/%lld 件の記録でキャッシュの計上方式と入力内訳を確認できます
ko: 기록 %lld/%lld개의 캐시 집계 방식과 입력 세부 내역을 확인할 수 있습니다

source: API 密钥
en: API key
ja: API キー
ko: API 키

source: API 类型
en: API type
ja: API タイプ
ko: API 유형

source: Agent 将能够在此后端目录执行任务： %@
en: The Agent will be able to run tasks in this backend directory: %@
ja: エージェントはこのバックエンドのディレクトリでタスクを実行できるようになります： %@
ko: 에이전트가 이 백엔드 디렉터리에서 작업을 실행할 수 있게 됩니다: %@

source: Agent 正忙，请求已加入候选队列，将在当前任务结束后发送。
en: The Agent is busy. The request was added to the candidate queue and will be sent after the current task finishes.
ja: エージェントは処理中です。リクエストは候補キューに追加され、現在のタスクの終了後に送信されます。
ko: 에이전트가 작업 중입니다. 요청이 후보 큐에 추가되었으며 현재 작업이 끝난 후 전송됩니다.

source: Agent 请求未确认：%@
en: Agent request not confirmed: %@
ja: エージェントのリクエストが未確認です：%@
ko: 에이전트 요청이 확인되지 않음: %@

source: Agent 账户
en: Agent accounts
ja: エージェントアカウント
ko: 에이전트 계정

source: Agent 返回 usage 后，可在此查看已确认的统计。
en: Once the Agent returns usage, confirmed stats appear here.
ja: エージェントが usage を返すと、確認済みの統計をここで確認できます。
ko: 에이전트가 usage를 반환하면 여기에서 확인된 통계를 볼 수 있습니다.

source: Agent 队列 %lld 条%@
en: Agent queue: %lld%@
ja: エージェントキュー %lld 件%@
ko: 에이전트 큐 %lld개%@

source: Detached HEAD / 无分支
en: Detached HEAD / No branch
ja: Detached HEAD / ブランチなし
ko: Detached HEAD / 브랜치 없음

source: Fast · 后端暂不支持
en: Fast · Not supported by backend yet
ja: Fast · バックエンドは未対応
ko: Fast · 백엔드에서 아직 지원하지 않음

source: Git 不可用
en: Git unavailable
ja: Git を利用できません
ko: Git 사용 불가

source: Git 响应缺少状态字段
en: Git response is missing status fields
ja: Git の応答にステータスフィールドがありません
ko: Git 응답에 상태 필드가 없습니다

source: Git 扫描响应缺少 repositories
en: Git scan response is missing repositories
ja: Git スキャンの応答に repositories がありません
ko: Git 스캔 응답에 repositories가 없습니다

source: Git 操作
en: Git actions
ko: Git 작업

source: Git 操作仍需核对
en: Git action still needs review
ja: Git 操作はまだ確認が必要です
ko: Git 작업을 아직 확인해야 합니다

source: Git 操作结果
en: Git action result
ja: Git 操作の結果
ko: Git 작업 결과

source: Git 状态不可用：%@
en: Git status unavailable: %@
ja: Git ステータスを利用できません：%@
ko: Git 상태를 사용할 수 없음: %@

source: Git 状态响应缺少字段
en: Git status response is missing fields
ja: Git ステータスの応答にフィールドがありません
ko: Git 상태 응답에 필드가 없습니다

source: Git 读取和操作都将针对所选仓库。
en: Git reads and actions will target the selected repository.
ja: Git の読み取りと操作はすべて選択したリポジトリが対象になります。
ko: Git 읽기와 작업은 모두 선택한 리포지토리를 대상으로 합니다.

source: Git 返回内容没有确认此动作
en: Git's response did not confirm this action
ja: Git の応答ではこの操作が確認されませんでした
ko: Git 응답에서 이 작업이 확인되지 않았습니다

source: JSON、二维码图片、相机扫码与分片二维码
en: JSON, QR code images, camera scanning, and multi-part QR codes
ja: JSON、QR コード画像、カメラスキャン、分割 QR コード
ko: JSON, QR 코드 이미지, 카메라 스캔 및 분할 QR 코드

source: Legacy Diff 不可用
en: Legacy Diff unavailable
ja: Legacy Diff を利用できません
ko: Legacy Diff 사용 불가

source: Legacy Diff 不可用：%@
en: Legacy Diff unavailable: %@
ja: Legacy Diff を利用できません：%@
ko: Legacy Diff 사용 불가: %@

source: Legacy Diff 已返回
en: Legacy Diff returned
ja: Legacy Diff が返されました
ko: Legacy Diff 반환됨

source: MCP 刷新响应的资源标识不匹配
en: MCP refresh response resource ID does not match
ja: MCP 更新応答のリソース ID が一致しません
ko: MCP 새로고침 응답의 리소스 식별자가 일치하지 않습니다

source: MCP 只能查看当前对话所用 Agent 的服务，请切换到该 Agent 或通用视图。
en: MCP servers can only be listed for the current conversation's Agent. Switch to that Agent or the common view.
ja: MCP は現在の会話のエージェントのサーバーのみ表示できます。そのエージェントか共通ビューに切り替えてください。
ko: MCP는 현재 대화의 에이전트 서버만 볼 수 있습니다. 해당 에이전트나 공통 보기로 전환하세요.

source: MCP 结果
en: MCP result
ja: MCP の結果
ko: MCP 결과

source: Merge 提交
en: Merge commit
ja: マージコミット
ko: 머지 커밋

source: OpenCode 需要同时给出上下文窗口与最大输出。
en: OpenCode requires both a context window and a max output.
ja: OpenCode ではコンテキストウィンドウと最大出力の両方が必要です。
ko: OpenCode에는 컨텍스트 윈도우와 최대 출력이 모두 필요합니다.

source: PR #%lld %@ %@ → %@ 状态：%@%@
en: PR #%lld %@ %@ → %@ Status: %@%@
ja: PR #%lld %@ %@ → %@ 状態：%@%@
ko: PR #%lld %@ %@ → %@ 상태: %@%@

source: PR 与代码更改
en: PRs & code changes
ja: PR とコード変更
ko: PR과 코드 변경

source: PR 修复
en: PR fixes
ja: PR 修正
ko: PR 수정

source: PR 合并
en: PR merge
ja: PR マージ
ko: PR 머지

source: PR 描述
en: PR description
ja: PR 説明
ko: PR 설명

source: PR 状态已更新
en: PR status updated
ja: PR の状態を更新しました
ko: PR 상태가 업데이트되었습니다

source: PR 状态读取失败：%@
en: Failed to read PR status: %@
ja: PR の状態の読み取りに失敗しました：%@
ko: PR 상태를 읽지 못했습니다: %@

source: PR 管理
en: PR management
ko: PR 관리

source: PTY 未在运行 · 自动重启中
en: PTY not running · Restarting automatically
ja: PTY は実行されていません · 自動再起動中
ko: PTY가 실행 중이 아님 · 자동 재시작 중

source: Provider 默认
en: Provider default
ja: プロバイダーのデフォルト
ko: 프로바이더 기본값

source: Rebase 合并
en: Rebase and merge
ja: リベースマージ
ko: 리베이스 머지

source: Shell 无效
en: Invalid shell
ja: シェルが無効です
ko: 셸이 잘못되었습니다

source: Shell（默认）
en: Shell (default)
ja: シェル（デフォルト）
ko: 셸(기본)

source: Squash 合并
en: Squash and merge
ja: スカッシュマージ
ko: 스쿼시 머지

source: Token 由主程序通过 Keychain 保存。传输加密启用时，连接还需要对应的公钥。
en: The token is stored by the app in the Keychain. When transport encryption is enabled, connecting also requires the matching public key.
ja: Token はアプリ本体がキーチェーンに保存します。転送暗号化が有効な場合、接続には対応する公開鍵も必要です。
ko: Token은 앱이 키체인에 저장합니다. 전송 암호화가 활성화되어 있으면 연결에 해당 공개 키도 필요합니다.

source: [Git 分支 %@]
en: [Git branch %@]
ja: [Git ブランチ %@]
ko: [Git 브랜치 %@]

source: [Git 工作树 %@]
en: [Git worktree %@]
ja: [Git ワークツリー %@]
ko: [Git 워크트리 %@]

source: [图片]
en: [Image]
ja: [画像]
ko: [이미지]

source: [网页元素 %@%@]
en: [Web element %@%@]
ja: [Web 要素 %@%@]
ko: [웹 요소 %@%@]

source: http(s):// 地址或工作区 HTML 绝对路径
en: http(s):// URL or absolute path to workspace HTML
ja: http(s):// アドレスまたはワークスペース HTML の絶対パス
ko: http(s):// 주소 또는 워크스페이스 HTML 절대 경로

source: iPhone 与 iPad 原生客户端。
en: Native client for iPhone and iPad.
ja: iPhone と iPad 向けのネイティブクライアント。
ko: iPhone 및 iPad용 네이티브 클라이언트.

source: live 配置与所选供应商不一致
en: Live config differs from the selected provider
ja: live 設定が選択したプロバイダーと一致しません
ko: live 설정이 선택한 프로바이더와 다릅니다

source: ↓ 最新消息
en: ↓ Latest messages
ja: ↓ 最新のメッセージ
ko: ↓ 최신 메시지

source: 「%@」不符合请求的字段类型、范围或必填要求。
en: "%@" does not meet the requested field type, range, or required constraint.
ja: 「%@」が要求されたフィールドの型、範囲、または必須条件を満たしていません。
ko: "%@"이(가) 요청한 필드 유형, 범위 또는 필수 조건을 충족하지 않습니다.

source: 「%@」需要可精确表示的整数（绝对值不超过 9007199254740991）。
en: "%@" needs an exactly representable integer (absolute value no greater than 9007199254740991).
ja: 「%@」には正確に表現できる整数が必要です（絶対値 9007199254740991 以下）。
ko: "%@"에는 정확히 표현 가능한 정수가 필요합니다(절댓값 9007199254740991 이하).

source: 「%@」需要有效数字。
en: "%@" needs a valid number.
ja: 「%@」には有効な数値が必要です。
ko: "%@"에는 유효한 숫자가 필요합니다.

source: 「%@」需要有效的 JSON 值。
en: "%@" needs a valid JSON value.
ja: 「%@」には有効な JSON 値が必要です。
ko: "%@"에는 유효한 JSON 값이 필요합니다.

source: 一致
en: Matches
ko: 일치

source: 一起把想法变成现实
en: Turn ideas into reality together
ja: 一緒にアイデアを形にしましょう
ko: 함께 아이디어를 현실로

source: 上下文压缩失败
en: Context compaction failed
ja: コンテキストの圧縮に失敗しました
ko: 컨텍스트 압축 실패

source: 上下文压缩失败：%@
en: Context compaction failed: %@
ja: コンテキストの圧縮に失敗しました：%@
ko: 컨텍스트 압축 실패: %@

source: 上下文压缩完成
en: Context compaction complete
ja: コンテキストの圧縮が完了しました
ko: 컨텍스트 압축 완료

source: 上下文已使用 %lld%%
en: Context %lld%% used
ja: コンテキスト使用率 %lld%%
ko: 컨텍스트 %lld%% 사용됨

source: 上下文已接近上限，建议压缩
en: Context is near its limit; compaction recommended
ja: コンテキストが上限に近づいています。圧縮をおすすめします
ko: 컨텍스트가 한도에 가까워졌습니다. 압축을 권장합니다

source: 上下文用量
en: Context usage
ja: コンテキスト使用量
ko: 컨텍스트 사용량

source: 上下文用量等待模型窗口信息
en: Context usage is waiting for model window info
ja: コンテキスト使用量はモデルのウィンドウ情報を待機中
ko: 컨텍스트 사용량이 모델 윈도우 정보를 기다리는 중

source: 上下文窗口
en: Context window
ja: コンテキストウィンドウ
ko: 컨텍스트 윈도우

source: 上次写入结果未知，请先核对仓库和远端
en: The result of the last write is unknown; check the repository and remote first
ja: 前回の書き込み結果が不明です。先にリポジトリとリモートを確認してください
ko: 마지막 쓰기 결과를 알 수 없습니다. 먼저 리포지토리와 원격을 확인하세요

source: 上级目录
en: Parent directory
ja: 親ディレクトリ
ko: 상위 디렉터리

source: 不可用
en: Unavailable
ja: 利用不可
ko: 사용 불가

source: 不可达
en: Unreachable
ja: 到達不可
ko: 연결 불가

source: 之后手动发送可能产生重复任务。请先核对后端记录。
en: Sending manually later may create duplicate tasks. Review the backend history first.
ja: 後で手動送信すると、タスクが重複する可能性があります。先にバックエンドの履歴を確認してください。
ko: 나중에 수동으로 보내면 작업이 중복될 수 있습니다. 먼저 백엔드 기록을 확인하세요.

source: 交给 Agent 核对：%@
en: Ask the Agent to review: %@
ja: エージェントに確認を依頼：%@
ko: 에이전트에게 확인 요청: %@

source: 仅对此标签生效。工作区 HTML 可能由 Agent 生成，脚本可以从此设备发起网络请求。
en: Applies to this tab only. Workspace HTML may be generated by the Agent, and scripts can make network requests from this device.
ja: このタブにのみ適用されます。ワークスペースの HTML はエージェントが生成した可能性があり、スクリプトはこのデバイスからネットワークリクエストを送信できます。
ko: 이 탭에만 적용됩니다. 워크스페이스 HTML은 에이전트가 생성했을 수 있으며, 스크립트가 이 기기에서 네트워크 요청을 보낼 수 있습니다.

source: 仅恢复 PTY 标识；离开操作台期间的输出和历史滚屏无法重放。
en: Only the PTY ID is restored; output and scrollback from while you were away from the workbench cannot be replayed.
ja: PTY の識別子のみ復元されます。ワークベンチを離れていた間の出力とスクロールバック履歴は再生できません。
ko: PTY 식별자만 복원됩니다. 워크벤치를 떠나 있는 동안의 출력과 스크롤백 기록은 재생할 수 없습니다.

source: 仅本次允许
en: Allow once
ja: 今回のみ許可
ko: 이번만 허용

source: 仅浏览目录
en: Browse directories only
ja: ディレクトリの参照のみ
ko: 디렉터리만 찾아보기

source: 仅计算已知缓存计数口径的记录（%lld/%lld 条）；旧记录或未知口径不参与比例计算。
en: Only records with known cache accounting are counted (%lld/%lld); older records or unknown accounting are excluded from the ratio.
ja: キャッシュの計上方式が判明している記録のみ集計します（%lld/%lld 件）。古い記録や計上方式が不明な記録は比率の計算に含まれません。
ko: 캐시 집계 방식이 알려진 기록만 계산합니다(%lld/%lld개). 이전 기록이나 집계 방식을 알 수 없는 기록은 비율 계산에서 제외됩니다.

source: 仅调试构建可用。记录连接生命周期，最多保留最近 %lld 条；令牌与密钥在写入前已脱敏。
en: Debug builds only. Logs the connection lifecycle, keeping up to the latest %lld entries; tokens and keys are redacted before writing.
ja: デバッグビルドでのみ利用できます。接続のライフサイクルを記録し、最新 %lld 件まで保持します。Token と鍵は書き込み前にマスクされます。
ko: 디버그 빌드에서만 사용할 수 있습니다. 연결 수명 주기를 기록하며 최근 %lld개까지 보관합니다. Token과 키는 기록 전에 마스킹됩니다.

source: 仍有冲突标记
en: Conflict markers remain
ja: コンフリクトマーカーが残っています
ko: 충돌 표시가 남아 있습니다

source: 从一个想法开始
en: Start with an idea
ja: アイデアから始めましょう
ko: 아이디어로 시작하세요

source: 从剪贴板导入
en: Import from clipboard
ja: クリップボードからインポート
ko: 클립보드에서 가져오기

source: 从此处分叉
en: Fork from here
ja: ここから分岐
ko: 여기서 분기

source: 从照片选择二维码
en: Choose QR code from Photos
ja: 写真から QR コードを選択
ko: 사진에서 QR 코드 선택

source: 仓库与提交
en: Repository & commits
ja: リポジトリとコミット
ko: 리포지토리와 커밋

source: 仓库：%@ 分支：%@ %@
en: Repository: %@ Branch: %@ %@
ja: リポジトリ：%@ ブランチ：%@ %@
ko: 리포지토리: %@ 브랜치: %@ %@

source: 任务
en: Task
ja: タスク
ko: 작업

source: 任务交接
en: Task handoff
ja: タスク引き継ぎ
ko: 작업 인계

source: 任务完成提醒
en: Task completion alerts
ja: タスク完了の通知
ko: 작업 완료 알림

source: 任务已完成
en: Task completed
ja: タスクが完了しました
ko: 작업 완료

source: 任务描述（可选）
en: Task description (optional)
ja: タスク説明（任意）
ko: 작업 설명(선택)

source: 任务操作
en: Task actions
ja: タスク操作
ko: 작업 동작

source: 任务标题
en: Task title
ja: タスクタイトル
ko: 작업 제목

source: 任务标题不能为空，且任务总数不能超过 500 个。
en: Task title can't be empty, and there can be at most 500 tasks.
ja: タスクタイトルは必須で、タスクの総数は 500 件以下にする必要があります。
ko: 작업 제목은 비워 둘 수 없으며 작업은 최대 500개까지 만들 수 있습니다.

source: 任务正常完成并收到回复时发送系统通知；正在查看的对话不提醒。
en: Sends a system notification when a task finishes with a reply; not for the conversation you're viewing.
ja: タスクが完了して返信を受け取るとシステム通知を送ります。表示中の会話では通知しません。
ko: 작업이 완료되어 답변을 받으면 시스템 알림을 보냅니다. 보고 있는 대화는 알리지 않습니다.

source: 任务状态
en: Task status
ja: タスク状態
ko: 작업 상태

source: 任务状态：%@
en: Task status: %@
ja: タスク状態：%@
ko: 작업 상태: %@

source: 任务：%@
en: Task: %@
ja: タスク：%@
ko: 작업: %@

source: 会继续重试
en: Will keep retrying
ja: 再試行を続けます
ko: 계속 다시 시도합니다

source: 会话正在回放或记录存在缺口。请同步完成后重新打开审批。
en: The session is replaying or its history has gaps. Reopen the approval after syncing finishes.
ja: セッションを再生中か、履歴に欠落があります。同期の完了後に承認を開き直してください。
ko: 세션을 재생 중이거나 기록에 누락이 있습니다. 동기화가 끝난 후 승인을 다시 여세요.

source: 传输加密
en: Transport encryption
ja: 転送暗号化
ko: 전송 암호화

source: 你
en: You
ja: あなた
ko: 나

source: 你的回答
en: Your answer
ja: あなたの回答
ko: 답변

source: 使用统计
en: Usage
ja: 使用統計
ko: 사용 통계

source: 供应商
en: Provider
ja: プロバイダー
ko: 프로바이더

source: 供应商 ID
en: Provider ID
ja: プロバイダー ID
ko: 프로바이더 ID

source: 保存
en: Save
ko: 저장

source: 保存中…
en: Saving…
ko: 저장 중…

source: 保存修改
en: Save changes
ja: 変更を保存
ko: 변경 사항 저장

source: 保存冲突 · 本地编辑已保留
en: Save conflict · Local edits kept
ja: 保存の競合 · ローカルの編集は保持されました
ko: 저장 충돌 · 로컬 편집 유지됨

source: 保存并连接
en: Save and connect
ja: 保存して接続
ko: 저장 후 연결

source: 保存未确认 · 本地编辑已保留
en: Save not confirmed · Local edits kept
ja: 保存未確認 · ローカルの編集は保持されました
ko: 저장 확인 안 됨 · 로컬 편집 유지됨

source: 保存进行中
en: Saving in progress
ja: 保存中
ko: 저장 진행 중

source: 保留 PTY，仅关闭标签
en: Keep PTY, close tab only
ja: PTY を保持してタブのみ閉じる
ko: PTY 유지, 탭만 닫기

source: 保留编辑
en: Keep edits
ja: 編集を保持
ko: 편집 유지

source: 信任此工作区？
en: Trust this workspace?
ja: このワークスペースを信頼しますか？
ko: 이 워크스페이스를 신뢰하시겠습니까?

source: 信任状态已更新
en: Trust status updated
ja: 信頼状態を更新しました
ko: 신뢰 상태가 업데이트되었습니다

source: 修复失败检查
en: Fix failing checks
ja: 失敗したチェックを修正
ko: 실패한 체크 수정

source: 修改意见
en: Revision notes
ja: 修正の指示
ko: 수정 의견

source: 修改意见（拒绝计划时发送，可选）
en: Revision notes (sent when rejecting the plan, optional)
ja: 修正の指示（計画を却下するときに送信、任意）
ko: 수정 의견(계획 거부 시 전송, 선택)

source: 候选消息
en: Candidate messages
ja: 候補メッセージ
ko: 후보 메시지

source: 候选消息 %lld 条%@
en: Candidate messages: %lld%@
ja: 候補メッセージ %lld 件%@
ko: 후보 메시지 %lld개%@

source: 候选消息最多 32 条
en: Up to 32 candidate messages
ja: 候補メッセージは最大 32 件
ko: 후보 메시지는 최대 32개

source: 候选消息未发送：%@
en: Candidate message not sent: %@
ja: 候補メッセージは送信されていません：%@
ko: 후보 메시지 전송 안 됨: %@

source: 停止
en: Stop
ko: 중지

source: 停止 PTY 并关闭
en: Stop PTY and close
ja: PTY を停止して閉じる
ko: PTY 중지 후 닫기

source: 停止信号已发送，等待退出…
en: Stop signal sent, waiting for exit…
ja: 停止シグナルを送信しました。終了を待っています…
ko: 중지 신호를 보냈습니다. 종료를 기다리는 중…

source: 停止此终端？
en: Stop this terminal?
ja: このターミナルを停止しますか？
ko: 이 터미널을 중지하시겠습니까?

source: 元数据
en: Metadata
ja: メタデータ
ko: 메타데이터

source: 先发送或保存当前草稿，再编辑候选消息。
en: Send or save the current draft before editing candidate messages.
ja: 候補メッセージを編集する前に、現在の下書きを送信または保存してください。
ko: 후보 메시지를 편집하기 전에 현재 초안을 보내거나 저장하세요.

source: 先处理当前草稿，再恢复待核对消息。
en: Handle the current draft before restoring messages pending review.
ja: 確認待ちのメッセージを復元する前に、現在の下書きを処理してください。
ko: 확인 대기 메시지를 복원하기 전에 현재 초안을 처리하세요.

source: 全屏编辑
en: Edit full screen
ja: 全画面で編集
ko: 전체 화면 편집

source: 全部
en: All
ja: すべて
ko: 전체

source: 共享范围
en: Sharing scope
ja: 共有範囲
ko: 공유 범위

source: 关于
en: About
ja: バージョン情報
ko: 정보

source: 关联到对话
en: Link to conversation
ja: 会話に関連付け
ko: 대화에 연결

source: 关闭
en: Close
ja: 閉じる
ko: 닫기

source: 关闭 %@
en: Close %@
ja: %@ を閉じる
ko: %@ 닫기

source: 关闭 PR
en: Close PR
ja: PR をクローズ
ko: PR 닫기

source: 关闭审批页，不提交回答
en: Close the approval page without submitting an answer
ja: 回答を送信せずに承認ページを閉じる
ko: 답변을 제출하지 않고 승인 페이지 닫기

source: 关闭当前标签
en: Close current tab
ja: 現在のタブを閉じる
ko: 현재 탭 닫기

source: 关闭标签
en: Close tab
ja: タブを閉じる
ko: 탭 닫기

source: 关闭标签会丢失当前文件的本地编辑。
en: Closing the tab discards local edits to the current file.
ja: タブを閉じると、現在のファイルのローカル編集は失われます。
ko: 탭을 닫으면 현재 파일의 로컬 편집이 사라집니다.

source: 关闭终端标签
en: Close terminal tab
ja: ターミナルタブを閉じる
ko: 터미널 탭 닫기

source: 关闭页面不会取消服务器上已经开始的升级。
en: Closing this page won't cancel an upgrade already started on the server.
ja: ページを閉じても、サーバーで開始済みのアップグレードはキャンセルされません。
ko: 페이지를 닫아도 서버에서 이미 시작된 업그레이드는 취소되지 않습니다.

source: 其他后端
en: Other backends
ja: その他のバックエンド
ko: 다른 백엔드

source: 其他后端：%@
en: Other backend: %@
ja: その他のバックエンド：%@
ko: 다른 백엔드: %@

source: 内容
en: Content
ko: 내용

source: 内容已超出本地保存上限，无法预览。
en: Content exceeds the local storage limit and can't be previewed.
ja: 内容がローカル保存の上限を超えているため、プレビューできません。
ko: 내용이 로컬 저장 한도를 초과하여 미리 볼 수 없습니다.

source: 写入对话草稿
en: Write to chat draft
ja: 会話下書きに書き込む
ko: 대화 초안에 작성

source: 分叉对话
en: Fork conversation
ja: 会話を分岐
ko: 대화 분기

source: 分叉已响应，但未返回新对话标识，请刷新对话列表核对。
en: The fork responded but returned no new conversation id. Refresh the conversation list to verify.
ja: 分岐は応答しましたが新しい会話 ID が返りませんでした。会話一覧を更新して確認してください。
ko: 분기는 응답했지만 새 대화 식별자를 반환하지 않았습니다. 대화 목록을 새로 고쳐 확인하세요.

source: 分叉已完成，但新对话尚未出现在列表中，请刷新核对。
en: Fork completed, but the new conversation isn't in the list yet. Refresh to verify.
ja: 分岐は完了しましたが、新しい会話がまだ一覧に表示されていません。更新して確認してください。
ko: 분기는 완료되었지만 새 대화가 아직 목록에 표시되지 않습니다. 새로 고쳐 확인하세요.

source: 分支
en: Branch
ja: ブランチ
ko: 브랜치

source: 分支名称
en: Branch name
ja: ブランチ名
ko: 브랜치 이름

source: 分支（%lld）
en: Branches (%lld)
ja: ブランチ（%lld）
ko: 브랜치(%lld)

source: 分片可按任意顺序扫描；收齐同一批次后才会保存配对信息。
en: Parts can be scanned in any order; pairing info is saved only after every part of the same batch is collected.
ja: 分割コードは任意の順序でスキャンできます。同じバッチをすべて読み取った後にペアリング情報が保存されます。
ko: 분할 코드는 어떤 순서로든 스캔할 수 있으며, 같은 묶음을 모두 모은 후에 페어링 정보가 저장됩니다.

source: 分片进度 %lld/%lld
en: Parts scanned %lld/%lld
ja: 分割コードの進捗 %lld/%lld
ko: 분할 코드 진행률 %lld/%lld

source: 分类：%@
en: Category: %@
ja: カテゴリ：%@
ko: 분류: %@

source: 切换供应商？
en: Switch provider?
ja: プロバイダーを切り替えますか？
ko: 프로바이더를 전환하시겠습니까?

source: 切换分支
en: Switch branch
ja: ブランチを切り替え
ko: 브랜치 전환

source: 切换分支要求当前工作树干净，且目标未被其它工作树占用。
en: Switching branches requires a clean worktree, and the target must not be checked out in another worktree.
ja: ブランチを切り替えるには、現在のワークツリーがクリーンで、対象が他のワークツリーで使用されていない必要があります。
ko: 브랜치를 전환하려면 현재 워크트리가 깨끗해야 하며 대상이 다른 워크트리에서 사용 중이 아니어야 합니다.

source: 切换到此分支
en: Switch to this branch
ja: このブランチに切り替え
ko: 이 브랜치로 전환
